# SelectionChangedEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SelectionChangedEventArgs Members
SelectionChangedEventArgs Class Methods Properties See Also
---
The SelectionChangedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RevitAPIEventArgs.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDocument | Returns the document associated with this event. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetReferences | Returns the references that are currently selected. |
| GetSelectedElements | Returns ElementIds of selected elements. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsCancelled | Indicates whether the event is being cancelled.  (Inherited from RevitAPIEventArgs.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |

# See Also
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace